{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_1", "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "filters": 32, "dtype": "float32", "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "activation": "relu", "data_format": "channels_last", "batch_input_shape": [null, 50, 50, 3], "trainable": true, "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_2", "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "filters": 32, "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "units": 128, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "dense_2", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "units": 1, "kernel_regularizer": null, "activity_regularizer": null, "activation": "sigmoid", "trainable": true}}], "keras_version": "2.2.2"}