{"class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv2d_5", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "padding": "valid", "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 50, 50, 3], "dilation_rate": [1, 1], "filters": 32, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv2d_6", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "padding": "valid", "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 32, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "dense_5", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "use_bias": true, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "dense_6", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "sigmoid", "kernel_regularizer": null, "use_bias": true, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}}], "backend": "tensorflow"}